## Tambahan

input() --> menerima input dr user

In [5]:
parameter1 = input('Masukan angka ke-1....')
parameter2 = input('Masukan angka ke-2....')

print(parameter1)
print(parameter2)

Masukan angka ke-1....50
Masukan angka ke-2....20
50
20

In [11]:
kalimat = input('Masukan kalimat....')
parameter = kalimat.split()

parameter[0]
parameter[1]

Masukan kalimat....aku adalah anak gembala

'adalah'

type() --> mengecek tipe data dari sebuah variabel

In [4]:
parameter2 = input('Masukan angka....')

print(type(parameter2))

Masukan angka....50
<class 'str'>

## Pandas

- Series and dataframe
- Create dataframe
- Select dataframe
- Filter dataframe
- Manipulate dataframe
  - Add column
  - Remove column
- Describe and info

In [22]:
import pandas as pd
import numpy as np

In [ ]:
http://bit.ly/dwp-data-ojol

In [14]:
data_ojol = {'Customer':['tom', 'nick', 'krish', 'jack', 'jack', 'tom', 'jack', 'krish', 'nick', 'nick'],
          'Origin':['Tebet', 'Gondangdia', 'Mampang', 'SCBD', 'SCBD', 'Kuningan', 'Pancoran', 'Tebet', 'Mampang', 'Tebet'],
          'Destination':['Gondangdia', 'Mampang', 'SCBD', 'Kuningan', 'Pancoran', 'Pancoran', 'Mampang', 'SCBD', 'SCBD', 'Kuningan'],
          'Distance': [4.5, 5.0, 3.0, 4.8, 2.2, 4.7, 3.4, 4.0, 2.2, 2.9],
          'Price': [20000, 23000, 14000, 24500, 7000, 20000, 15000, 18500, 9000, 11000]}
          
data_ojol = pd.DataFrame(data_ojol)

data_ojol

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

### DataFrame function

.head() --> mengambil n rows paling atas (default n = 5)

In [85]:
data_ojol.head(1)

  Customer Origin Destination  Distance  Price
0      tom  Tebet  Gondangdia       4.5  20000

.tail() --> mengambil n rows paling bawah (default n = 5)

In [87]:
data_ojol.tail(2)

  Customer   Origin Destination  Distance  Price
8     nick  Mampang        SCBD       2.2   9000
9     nick    Tebet    Kuningan       2.9  11000

### Series function

.unique() --> untuk melihat nilai unik pada Series

In [36]:
list(data_ojol['Origin'].unique())

['Tebet', 'Gondangdia', 'Mampang', 'SCBD', 'Kuningan', 'Pancoran']

.mean() --> mencari nilai rata-rata

In [89]:
data_ojol['Distance'].mean()

3.6700000000000004

.median() --> mencari nilai tengah

In [39]:
data_ojol['Distance'].median()

3.7

.mode() --> mencari nilai yang paling banyak muncul

In [40]:
data_ojol['Distance'].mode()

0    2.2
dtype: float64

### Aggregate DataFrame

.groupby()

- sum
- count
- min
- max
- mean
- median
- mode

In [45]:
data_ojol

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

In [51]:
data_ojol.groupby('Customer', as_index=False)['Distance'].sum()

  Customer  Distance
0     jack      10.4
1    krish       7.0
2     nick      10.1
3      tom       9.2

In [55]:
data_ojol.groupby('Customer', as_index=False)['Distance'].count()

  Customer  Distance
0     jack         3
1    krish         2
2     nick         3
3      tom         2

In [69]:
data_ojol.groupby(['Origin', 'Destination'], as_index=False)['Price'].sum()

       Origin Destination  Price
0  Gondangdia     Mampang  23000
1    Kuningan    Pancoran  20000
2     Mampang        SCBD  23000
3    Pancoran     Mampang  15000
4        SCBD    Kuningan  24500
5        SCBD    Pancoran   7000
6       Tebet  Gondangdia  20000
7       Tebet    Kuningan  11000
8       Tebet        SCBD  18500

In [93]:
data_ojol.groupby('Customer', as_index=False) \
         .agg({'Distance': ['sum', 'count']})

  Customer Distance
                sum count
0     jack     10.4     3
1    krish      7.0     2
2     nick     10.1     3
3      tom      9.2     2

### Sort Values DataFrame

In [73]:
data_ojol.sort_values('Distance', ascending=False)

  Customer      Origin Destination  Distance  Price
1     nick  Gondangdia     Mampang       5.0  23000
3     jack        SCBD    Kuningan       4.8  24500
5      tom    Kuningan    Pancoran       4.7  20000
0      tom       Tebet  Gondangdia       4.5  20000
7    krish       Tebet        SCBD       4.0  18500
6     jack    Pancoran     Mampang       3.4  15000
2    krish     Mampang        SCBD       3.0  14000
9     nick       Tebet    Kuningan       2.9  11000
4     jack        SCBD    Pancoran       2.2   7000
8     nick     Mampang        SCBD       2.2   9000

In [81]:
# Mencari total distance tiap customer
# Sorting berdasarkan distance paling tinggi

data_ojol.groupby('Customer', as_index=False)['Distance'].sum() \
         .sort_values('Distance', ascending=False)

  Customer  Distance
0     jack      10.4
2     nick      10.1
3      tom       9.2
1    krish       7.0

### Import data

- .read_csv()
- .read_excel()

In [90]:
data_bike = pd.read_csv('http://bit.ly/dwp-data-bike')

In [94]:
data_bike.head()

,tripduration,starttime,stoptime,start station name,end station name,bikeid,usertype,birth year,gender
0,261,2019-08-01 00:14:55.9900,2019-08-01 00:19:17.4780,JC Medical Center,Liberty Light Rail,26268,Subscriber,1980,1
1,172,2019-08-01 00:23:06.9910,2019-08-01 00:25:59.1480,Dixon Mills,Grove St PATH,26162,Subscriber,1996,1
2,525,2019-08-01 00:23:28.6170,2019-08-01 00:32:13.7000,Newport Pkwy,Hamilton Park,29279,Subscriber,1991,1
3,219,2019-08-01 00:32:36.1410,2019-08-01 00:36:15.2730,Warren St,City Hall,29598,Subscriber,1988,1
4,262,2019-08-01 00:41:26.6700,2019-08-01 00:45:49.3530,Grove St PATH,Jersey & 3rd,26162,Subscriber,1960,1

## Analytics
- Descriptive --> What is happening?
- Predictive --> What will happen?
- Prescriptive --> What can we do?

## Data Analysis Process

1. Question
2. Wrangle
    - Data Acquisition
    - Data Cleaning
    - Data Transformation
3. Explore
4. Conclusions
5. Communicate

### Wrangle

In [115]:
# Data Acquisition
data_bike = pd.read_csv('http://bit.ly/dwp-data-bike')

# Data Transformation
data_bike['age'] = 2020 - data_bike['birth year']

In [116]:
data_bike.head()

,tripduration,starttime,stoptime,start station name,end station name,bikeid,usertype,birth year,gender,age
0,261,2019-08-01 00:14:55.9900,2019-08-01 00:19:17.4780,JC Medical Center,Liberty Light Rail,26268,Subscriber,1980,1,40
1,172,2019-08-01 00:23:06.9910,2019-08-01 00:25:59.1480,Dixon Mills,Grove St PATH,26162,Subscriber,1996,1,24
2,525,2019-08-01 00:23:28.6170,2019-08-01 00:32:13.7000,Newport Pkwy,Hamilton Park,29279,Subscriber,1991,1,29
3,219,2019-08-01 00:32:36.1410,2019-08-01 00:36:15.2730,Warren St,City Hall,29598,Subscriber,1988,1,32
4,262,2019-08-01 00:41:26.6700,2019-08-01 00:45:49.3530,Grove St PATH,Jersey & 3rd,26162,Subscriber,1960,1,60

### Questions

1. Ada berapa kelompok umur yang menggunakan Citibike rental? (Opsional)
2. Berapa banyak trip yang dilakukan oleh pelanggan Subscriber?
3. Berapa rata-rata trip duration dari Subscriber dan Customer?

### Explore

In [122]:
# 1.

In [120]:
# 2. Trip yang dilakukan oleh Subscriber

trip_by_usertype = data_bike.groupby('usertype', as_index=False)['age'].count()
trip_by_usertype[(trip_by_usertype['usertype'] == 'Subscriber')]

     usertype    age
1  Subscriber  40081

In [121]:
# 3. Rata-rata trip duration dari Subscriber dan Customer

# yang kita cari --> usertype
# yang kita hitung --> tripduration
# fungsi agregasi --> mean

data_bike.groupby('usertype', as_index=False)['tripduration'].mean()

     usertype  tripduration
0    Customer    800.533745
1  Subscriber    428.787156

### Conclusions

1. ......

2. Terdapat 40.081 perjalanan yang dilakukan oleh Subscriber.

3. Subscriber memiliki rata-rata tripduration lebih rendah dari Customer, dengan perbandingan 428 detik dibanding 800 detik.

## Latihan

In [101]:
# 1. Rata-rata trip duration dalam 1 kali trip

data_bike['tripduration'].mean()

478.2327492969933

In [109]:
# 2. 5 Stasiun keberangkatan favorit

# -> nilai yg kita cari
# -> nilai yg kita hitung
# -> fungsi agregasi

data_bike.groupby('start station name', as_index=False)['bikeid'].count() \
         .rename(columns={'bikeid': 'total'}) \
         .sort_values('total', ascending=False) \
         .head()

            start station name  total
17               Grove St PATH   5356
18               Hamilton Park   2892
19                  Harborside   2241
8   Columbus Dr at Exchange Pl   2104
40                Newport PATH   2083